#ifndef __CLIENTSCRIPT_H__
#define __CLIENTSCRIPT_H__

#include "../export.h"
#include "../universal/q_shared.h"
#include "../database/db_public.h"

enum scriptInstance_t
{
	SCRIPTINSTANCE_SERVER = 0x0,
	SCRIPTINSTANCE_CLIENT = 0x1,
	SCRIPT_INSTANCE_MAX = 0x2,
};

typedef unsigned short ScriptString;

struct scr_const_t
{
	ScriptString _;// 0x0
	ScriptString active;// 0x2
	ScriptString spawn;// 0x4
	ScriptString exit;// 0x6
	ScriptString j_spine4;// 0x8
	ScriptString j_helmet;// 0xA
	ScriptString j_head;// 0xC
	ScriptString alert;// 0xE
	ScriptString all;// 0x10
	ScriptString allies;// 0x12
	ScriptString ambush;// 0x14
	ScriptString ambush_nodes_only;// 0x16
	ScriptString angles;// 0x18
	ScriptString any_exposed_nodes_only;// 0x1A
	ScriptString arc_min_pitch;// 0x1C
	ScriptString arc_max_pitch;// 0x1E
	ScriptString arc_min_yaw;// 0x20
	ScriptString arc_max_yaw;// 0x22
	ScriptString asleep;// 0x24
	ScriptString axis;// 0x26
	ScriptString bad_path;// 0x28
	ScriptString begin_firing;// 0x2A
	ScriptString unknown_location;// 0x2C
	ScriptString cancel_location;// 0x2E
	ScriptString confirm_location;// 0x30
	ScriptString _32;// 0x32
	ScriptString combat;// 0x34
	ScriptString cover;// 0x36
	ScriptString crouch;// 0x38
	ScriptString current;// 0x3A
	ScriptString damage;// 0x3C
	ScriptString deathshield;// 0x3E
	ScriptString damage_afterdeath;// 0x40
	ScriptString dead;// 0x42
	ScriptString death;// 0x44
	ScriptString disconnect;// 0x46
	ScriptString death_or_disconnect;// 0x48
	ScriptString detonate;// 0x4A
	ScriptString direct;// 0x4C
	ScriptString dlight;// 0x4E
	ScriptString done;// 0x50
	ScriptString dropweapon;// 0x52
	ScriptString empty;// 0x54
	ScriptString end_firing;// 0x56
	ScriptString enter_vehicle;// 0x58
	ScriptString entity;// 0x5A
	ScriptString exit_vehicle;// 0x5C
	ScriptString exposed_nodes_only;// 0x5E
	ScriptString change_seat;// 0x60
	ScriptString vehicle_death;// 0x62
	ScriptString explode;// 0x64
	ScriptString failed;// 0x66
	ScriptString free;// 0x68
	ScriptString fraction;// 0x6A
	ScriptString goal;// 0x6C
	ScriptString goal_changed;// 0x6E
	ScriptString goal_yaw;// 0x70
	ScriptString grenade;// 0x72
	ScriptString grenade_danger;// 0x74
	ScriptString grenade_flee;// 0x76
	ScriptString grenade_fire;// 0x78
	ScriptString grenade_launcher_fire;// 0x7A
	ScriptString grenade_pullback;// 0x7C
	ScriptString grenade_throwback;// 0x7E
	ScriptString stationary;// 0x80
	ScriptString grenade_stuck;// 0x82
	ScriptString grenade_bounce;// 0x84
	ScriptString hero;// 0x86
	ScriptString info_notnull;// 0x88
	ScriptString invisible;// 0x8A
	ScriptString j_gun;// 0x8C
	ScriptString key1;// 0x8E
	ScriptString key2;// 0x90
	ScriptString killanimscript;// 0x92
	ScriptString left;// 0x94
	ScriptString left_tread;// 0x96
	ScriptString light;// 0x98
	ScriptString missile_fire;// 0x9A
	ScriptString missile_boost;// 0x9C
	ScriptString movedone;// 0x9E
	ScriptString multikill;// 0xA0
	ScriptString next_node;// 0xA2
	ScriptString no_cover;// 0xA4
	ScriptString only_cover;// 0xA6
	ScriptString noclass;// 0xA8
	ScriptString node;// 0xAA
	ScriptString noncombat;// 0xAC
	ScriptString none;// 0xAE
	ScriptString normal;// 0xB0
	ScriptString origin;// 0xB2
	ScriptString over;// 0xB4
	ScriptString player;// 0xB6
	ScriptString point_relative;// 0xB8
	ScriptString position;// 0xBA
	ScriptString projectile_impact;// 0xBC
	ScriptString prone;// 0xBE
	ScriptString result;// 0xC0
	ScriptString right;// 0xC2
	ScriptString right_tread;// 0xC4
	ScriptString tank_armor;// 0xC6
	ScriptString reload;// 0xC8
	ScriptString reload_start;// 0xCA
	ScriptString rocket;// 0xCC
	ScriptString rotatedone;// 0xCE
	ScriptString script_brushmodel;// 0xD0
	ScriptString script_model;// 0xD2
	ScriptString script_origin;// 0xD4
	ScriptString snd_enveffectsprio_level;// 0xD6
	ScriptString snd_enveffectsprio_shellshock;// 0xD8
	ScriptString snd_busvolprio_holdbreath;// 0xDA
	ScriptString snd_busvolprio_pain;// 0xDC
	ScriptString snd_busvolprio_shellshock;// 0xDE
	ScriptString stand;// 0xE0
	ScriptString suppression;// 0xE2
	ScriptString suppression_end;// 0xE4
	ScriptString surfacetype;// 0xE6
	ScriptString tag_aim_pitch;// 0xE8
	ScriptString tag_aim;// 0xEA
	ScriptString tag_aim_animated;// 0xEC
	ScriptString tag_brass;// 0xEE
	ScriptString tag_brass1;// 0xF0
	ScriptString tag_brass_2;// 0xF2
	ScriptString tag_butt;// 0xF4
	ScriptString tag_clip;// 0xF6
	ScriptString tag_flash;// 0xF8
	ScriptString tag_explosive;// 0xFA
	ScriptString tag_flash1;// 0xFC
	ScriptString tag_flash2;// 0xFE
	ScriptString tag_flash3;// 0x100
	ScriptString tag_flash4;// 0x102
	ScriptString tag_flash_alt;// 0x104
	ScriptString tag_fx;// 0x106
	ScriptString tag_inhand;// 0x108
	ScriptString tag_knife_attach;// 0x10A
	ScriptString tag_knife_fx;// 0x10C
	ScriptString tag_bayonet;// 0x10E
	ScriptString tag_laser;// 0x110
	ScriptString tag_origin;// 0x112
	ScriptString tag_weapon;// 0x114
	ScriptString tag_weapon1;// 0x116
	ScriptString tag_player;// 0x118
	ScriptString tag_camera;// 0x11A
	ScriptString tag_weapon_right;// 0x11C
	ScriptString tag_weapon_left;// 0x11E
	ScriptString tag_stowed_back;// 0x120
	ScriptString tag_weapon_chest;// 0x122
	ScriptString tag_gasmask;// 0x124
	ScriptString tag_gasmask2;// 0x126
	ScriptString tag_sync;// 0x128
	ScriptString tag_wake;// 0x12A
	ScriptString target_script_trigger;// 0x12C
	ScriptString team3;// 0x12E
	ScriptString team_changed;// 0x130
	ScriptString tempEntity;// 0x132
	ScriptString top;// 0x134
	ScriptString touch;// 0x136
	ScriptString trigger;// 0x138
	ScriptString trigger_use;// 0x13A
	ScriptString trigger_use_touch;// 0x13C
	ScriptString trigger_damage;// 0x13E
	ScriptString trigger_lookat;// 0x140
	ScriptString trigger_radius;// 0x142
	ScriptString trigger_box;// 0x144
	ScriptString trigger_box_use;// 0x146
	ScriptString trigger_radius_use;// 0x148
	ScriptString truck_cam;// 0x14A
	ScriptString turret_return_default_pos;// 0x14C
	ScriptString turret_scan_start;// 0x14E
	ScriptString turret_scan_stop;// 0x150
	ScriptString turret_target_aquired;// 0x152
	ScriptString turret_target_lost;// 0x154
	ScriptString turret_tow_unlink;// 0x156
	ScriptString _158;// 0x158
	ScriptString weapon_change_on_turret;// 0x15A
	ScriptString weapon_change;// 0x15C
	ScriptString weapon_change_complete;// 0x15E
	ScriptString weapon_raising;// 0x160
	ScriptString weapon_fired;// 0x162
	ScriptString weapon_melee;// 0x164
	ScriptString weapon_switch_started;// 0x166
	ScriptString raise_riotshield;// 0x168
	ScriptString deploy_riotshield;// 0x16A
	ScriptString pickup_riotshield;// 0x16C
	ScriptString worldspawn;// 0x16E
	ScriptString flashbang;// 0x170
	ScriptString flash;// 0x172
	ScriptString smoke;// 0x174
	ScriptString night_vision_on;// 0x176
	ScriptString night_vision_off;// 0x178
	ScriptString back;// 0x17A
	ScriptString back_low;// 0x17C
	ScriptString back_mid;// 0x17E
	ScriptString back_up;// 0x180
	ScriptString head;// 0x182
	ScriptString j_mainroot;// 0x184
	ScriptString neck;// 0x186
	ScriptString pelvis;// 0x188
	ScriptString j_head_2;// 0x18A
	ScriptString purchased;// 0x18C
	ScriptString for_sale;// 0x18E
	ScriptString wrong_era;// 0x190
	ScriptString blacklisted;// 0x192
	ScriptString locked;// 0x194
	ScriptString mod_unknown;// 0x196
	ScriptString mod_pistol_bullet;// 0x198
	ScriptString mod_rifle_bullet;// 0x19A
	ScriptString mod_grenade;// 0x19C
	ScriptString mod_grenade_splash;// 0x19E
	ScriptString mod_projectile;// 0x1A0
	ScriptString mod_projectile_splash;// 0x1A2
	ScriptString mod_melee;// 0x1A4
	ScriptString mod_bayonet;// 0x1A6
	ScriptString mod_head_shot;// 0x1A8
	ScriptString mod_crush;// 0x1AA
	ScriptString mod_telefrag;// 0x1AC
	ScriptString mod_falling;// 0x1AE
	ScriptString mod_suicide;// 0x1B0
	ScriptString mod_trigger_hurt;// 0x1B2
	ScriptString mod_explosive;// 0x1B4
	ScriptString mod_impact;// 0x1B6
	ScriptString mod_burned;// 0x1B8
	ScriptString mod_hit_by_object;// 0x1BA
	ScriptString mod_drown;// 0x1BC
	ScriptString mod_gas;// 0x1BE
	ScriptString face;// 0x1C0
	ScriptString face_casual;// 0x1C2
	ScriptString face_alert;// 0x1C4
	ScriptString face_cqb;// 0x1C6
	ScriptString face_running;// 0x1C8
	ScriptString face_shoot_single;// 0x1CA
	ScriptString face_shoot_burst;// 0x1CC
	ScriptString face_melee;// 0x1CE
	ScriptString face_react;// 0x1D0
	ScriptString face_talk;// 0x1D2
	ScriptString face_talk_long;// 0x1D4
	ScriptString face_pain;// 0x1D6
	ScriptString face_death;// 0x1D8
	ScriptString melee;// 0x1DA
	ScriptString script_vehicle;// 0x1DC
	ScriptString script_vehicle_collision;// 0x1DE
	ScriptString script_vehicle_corpse;// 0x1E0
	ScriptString turret_fire;// 0x1E2
	ScriptString turret_on_target;// 0x1E4
	ScriptString gunner_turret_on_target;// 0x1E6
	ScriptString gunner_turret_overheat;// 0x1E8
	ScriptString gunner_turret_stop_overheat;// 0x1EA
	ScriptString turret_not_on_target;// 0x1EC
	ScriptString turret_on_vistarget;// 0x1EE
	ScriptString turret_no_vis;// 0x1F0
	ScriptString turret_rotate_stopped;// 0x1F2
	ScriptString turret_rotate_moving;// 0x1F4
	ScriptString turret_deactivate;// 0x1F6
	ScriptString turretstatechange;// 0x1F8
	ScriptString turretownerchange;// 0x1FA
	ScriptString reached_node;// 0x1FC
	ScriptString reached_end_node;// 0x1FE
	ScriptString reached_wait_node;// 0x200
	ScriptString reached_wait_speed;// 0x202
	ScriptString near_goal;// 0x204
	ScriptString veh_collision;// 0x206
	ScriptString veh_predictedcollision;// 0x208
	ScriptString veh_inair;// 0x20A
	ScriptString veh_landed;// 0x20C
	ScriptString veh_suspension_limit_activated;// 0x20E
	ScriptString veh_engine_stutter;// 0x210
	ScriptString veh_ejectoccupants;// 0x212
	ScriptString veh_heightmesh_max;// 0x214
	ScriptString veh_heightmesh_min;// 0x216
	ScriptString veh_stuck;// 0x218
	ScriptString script_camera;// 0x21A
	ScriptString begin;// 0x21C
	ScriptString jumpcut;// 0x21E
	ScriptString playerbreathinsound;// 0x220
	ScriptString playerbreathgaspsound;// 0x222
	ScriptString playerbreathoutsound;// 0x224
	ScriptString mantlesoundplayer;// 0x226
	ScriptString meleeswipesoundplayer;// 0x228
	ScriptString dtplandsoundplayer;// 0x22A
	ScriptString curve_nodehit;// 0x22C
	ScriptString curve_start;// 0x22E
	ScriptString curve_end;// 0x230
	ScriptString asphalt;// 0x232
	ScriptString bark;// 0x234
	ScriptString brick;// 0x236
	ScriptString carpet;// 0x238
	ScriptString ceramic;// 0x23A
	ScriptString cloth;// 0x23C
	ScriptString concrete;// 0x23E
	ScriptString cushion;// 0x240
	ScriptString dirt;// 0x242
	ScriptString flesh;// 0x244
	ScriptString foliage;// 0x246
	ScriptString fruit;// 0x248
	ScriptString glass;// 0x24A
	ScriptString grass;// 0x24C
	ScriptString gravel;// 0x24E
	ScriptString ice;// 0x250
	ScriptString metal;// 0x252
	ScriptString mud;// 0x254
	ScriptString paintedmetal;// 0x256
	ScriptString paper;// 0x258
	ScriptString plaster;// 0x25A
	ScriptString plastic;// 0x25C
	ScriptString rock;// 0x25E
	ScriptString rubber;// 0x260
	ScriptString sand;// 0x262
	ScriptString snow;// 0x264
	ScriptString water;// 0x266
	ScriptString wood;// 0x268
	ScriptString tag_enter_driver;// 0x26A
	ScriptString tag_enter_gunner1;// 0x26C
	ScriptString tag_enter_gunner2;// 0x26E
	ScriptString tag_enter_gunner3;// 0x270
	ScriptString tag_enter_gunner4;// 0x272
	ScriptString tag_enter_passenger;// 0x274
	ScriptString tag_enter_passenger2;// 0x276
	ScriptString tag_enter_passenger3;// 0x278
	ScriptString tag_enter_passenger4;// 0x27A
	ScriptString tag_driver;// 0x27C
	ScriptString tag_passenger;// 0x27E
	ScriptString tag_passenger2;// 0x280
	ScriptString tag_passenger3;// 0x282
	ScriptString tag_passenger4;// 0x284
	ScriptString tag_passenger5;// 0x286
	ScriptString tag_passenger6;// 0x288
	ScriptString tag_gunner1;// 0x28A
	ScriptString tag_gunner2;// 0x28C
	ScriptString tag_gunner3;// 0x28E
	ScriptString tag_gunner4;// 0x290
	ScriptString tag_gunner_barrel1;// 0x292
	ScriptString tag_gunner_barrel2;// 0x294
	ScriptString tag_gunner_barrel3;// 0x296
	ScriptString tag_gunner_barrel4;// 0x298
	ScriptString tag_gunner_turret1;// 0x29A
	ScriptString tag_gunner_turret2;// 0x29C
	ScriptString tag_gunner_turret3;// 0x29E
	ScriptString tag_gunner_turret4;// 0x2A0
	ScriptString tag_flash_gunner1;// 0x2A2
	ScriptString tag_flash_gunner2;// 0x2A4
	ScriptString tag_flash_gunner3;// 0x2A6
	ScriptString tag_flash_gunner4;// 0x2A8
	ScriptString tag_flash_gunner1a;// 0x2AA
	ScriptString tag_flash_gunner2a;// 0x2AC
	ScriptString tag_flash_gunner3a;// 0x2AE
	ScriptString tag_flash_gunner4a;// 0x2B0
	ScriptString tag_gunner_brass1;// 0x2B2
	ScriptString tag_gunner_brass1a;// 0x2B4
	ScriptString tag_gunner_brass2;// 0x2B6
	ScriptString tag_gunner_brass2a;// 0x2B8
	ScriptString tag_gunner_hands1;// 0x2BA
	ScriptString tag_wheel_front_left;// 0x2BC
	ScriptString tag_wheel_front_right;// 0x2BE
	ScriptString tag_wheel_back_left;// 0x2C0
	ScriptString tag_wheel_back_right;// 0x2C2
	ScriptString tag_wheel_middle_left;// 0x2C4
	ScriptString tag_wheel_middle_right;// 0x2C6
	ScriptString tag_wheel_front;// 0x2C8
	ScriptString tag_wheel_back;// 0x2CA
	ScriptString tag_main_rotor;// 0x2CC
	ScriptString tag_tail_rotor;// 0x2CE
	ScriptString tag_main_rotor_blur;// 0x2D0
	ScriptString tag_main_rotor_static;// 0x2D2
	ScriptString tag_tail_rotor_blur;// 0x2D4
	ScriptString tag_tail_rotor_static;// 0x2D6
	ScriptString tag_rotor_fl_arm;// 0x2D8
	ScriptString tag_rotor_fr_arm;// 0x2DA
	ScriptString tag_rotor_rl_arm;// 0x2DC
	ScriptString tag_rotor_rr_arm;// 0x2DE
	ScriptString tag_antenna1;// 0x2E0
	ScriptString tag_antenna2;// 0x2E2
	ScriptString host_sucks_end_game;// 0x2E4
	ScriptString freelook;// 0x2E6
	ScriptString localplayers;// 0x2E8
	ScriptString tag_enter_right;// 0x2EA
	ScriptString tag_enter_left;// 0x2EC
	ScriptString tag_enter_back;// 0x2EE
	ScriptString tag_popout;// 0x2F0
	ScriptString tag_body;// 0x2F2
	ScriptString tag_turret;// 0x2F4
	ScriptString tag_turret_base;// 0x2F6
	ScriptString tag_barrel;// 0x2F8
	ScriptString tag_barrel_recoil;// 0x2FA
	ScriptString tag_engine_left;// 0x2FC
	ScriptString tag_engine_right;// 0x2FE
	ScriptString tag_spin;// 0x300
	ScriptString tag_minigun_right_barrel;// 0x302
	ScriptString front_left;// 0x304
	ScriptString front_right;// 0x306
	ScriptString back_left;// 0x308
	ScriptString back_right;// 0x30A
	ScriptString middle_left;// 0x30C
	ScriptString middle_right;// 0x30E
	ScriptString stuck_to_player;// 0x310
	ScriptString stuck_to_shield;// 0x312
	ScriptString auto_ai;// 0x314
	ScriptString auto_nonai;// 0x316
	ScriptString manual;// 0x318
	ScriptString manual_ai;// 0x31A
	ScriptString scavenger;// 0x31C
	ScriptString neutral;// 0x31E
	ScriptString team4;// 0x320
	ScriptString team5;// 0x322
	ScriptString team6;// 0x324
	ScriptString team7;// 0x326
	ScriptString team8;// 0x328
	ScriptString auto_change;// 0x32A
	ScriptString call_vote;// 0x32C
	ScriptString intermission;// 0x32E
	ScriptString manual_change;// 0x330
	ScriptString menuresponse;// 0x332
	ScriptString pistol;// 0x334
	ScriptString plane_waypoint;// 0x336
	ScriptString playing;// 0x338
	ScriptString spectator;// 0x33A
	ScriptString spectator_cycle;// 0x33C
	ScriptString vote;// 0x33E
	ScriptString sprint_begin;// 0x340
	ScriptString sprint_end;// 0x342
	ScriptString tag_gunner_pov;// 0x344
	ScriptString tag_flamer_pilot_light;// 0x346
	ScriptString tag_fx_front;// 0x348
	ScriptString tag_fx_right;// 0x34A
	ScriptString tag_fx_left;// 0x34C
	ScriptString flared_or_tabuned_death;// 0x34E
	ScriptString destroyed_vehicle;// 0x350
	ScriptString vehicle_driver;// 0x352
	ScriptString died_in_turret;// 0x354
	ScriptString force_crouch;// 0x356
	ScriptString trigger_use_doubletap;// 0x358
	ScriptString doubletap_detonate;// 0x35A
	ScriptString dtp_through_glass;// 0x35C
	ScriptString dtp_start;// 0x35E
	ScriptString dtp_end;// 0x360
	ScriptString mantle_start;// 0x362
	ScriptString moon_gravity;// 0x364
	ScriptString draw;// 0x366
	ScriptString remote_revive;// 0x368
	ScriptString begin_custom_anim;// 0x36A
	ScriptString deathplant;// 0x36C
	ScriptString zombie;// 0x36E
	ScriptString zombie_dog;// 0x370
	ScriptString custom;// 0x372
	ScriptString angle_deltas;// 0x374
	ScriptString bigdog;// 0x376
	ScriptString bulletwhizby;// 0x378
	ScriptString dog;// 0x37A
	ScriptString enemy;// 0x37C
	ScriptString enemy_visible;// 0x37E
	ScriptString face_angle;// 0x380
	ScriptString face_current;// 0x382
	ScriptString face_default;// 0x384
	ScriptString face_direction;// 0x386
	ScriptString face_enemy;// 0x388
	ScriptString face_enemy_or_motion;// 0x38A
	ScriptString face_enemy_or_motion_sidestep;// 0x38C
	ScriptString face_goal;// 0x38E
	ScriptString face_motion;// 0x390
	ScriptString face_point;// 0x392
	ScriptString gravity;// 0x394
	ScriptString groundEntChanged;// 0x396
	ScriptString gunshot;// 0x398
	ScriptString obstacle;// 0x39A
	ScriptString movemode;// 0x39C
	ScriptString node_out_of_range;// 0x39E
	ScriptString node_relinquished;// 0x3A0
	ScriptString node_taken;// 0x3A2
	ScriptString node_not_safe;// 0x3A4
	ScriptString noclip;// 0x3A6
	ScriptString nogravity;// 0x3A8
	ScriptString slide;// 0x3AA
	ScriptString nophysics;// 0x3AC
	ScriptString pain;// 0x3AE
	ScriptString react;// 0x3B0
	ScriptString pos_deltas;// 0x3B2
	ScriptString run;// 0x3B4
	ScriptString runto_arrived;// 0x3B6
	ScriptString silenced_shot;// 0x3B8
	ScriptString spawned;// 0x3BA
	ScriptString start_move;// 0x3BC
	ScriptString stop;// 0x3BE
	ScriptString stop_soon;// 0x3C0
	ScriptString tag_eye;// 0x3C2
	ScriptString walk;// 0x3C4
	ScriptString world;// 0x3C6
	ScriptString zonly_physics;// 0x3C8
	ScriptString down;// 0x3CA
	ScriptString j_ankle_le;// 0x3CC
	ScriptString j_ankle_ri;// 0x3CE
	ScriptString j_ball_le;// 0x3D0
	ScriptString j_ball_ri;// 0x3D2
	ScriptString j_palm_le;// 0x3D4
	ScriptString j_palm_ri;// 0x3D6
	ScriptString j_elbow_le;// 0x3D8
	ScriptString j_wrist_le;// 0x3DA
	ScriptString broken;// 0x3DC
	ScriptString destructible;// 0x3DE
	ScriptString destructible_base_piece_death;// 0x3E0
	ScriptString breakafter;// 0x3E2
	ScriptString snapacknowledged;// 0x3E4
	ScriptString snap_processed;// 0x3E6
	ScriptString j_barrel;// 0x3E8
	ScriptString j_counter;// 0x3EA
	ScriptString j_dial_left;// 0x3EC
	ScriptString j_dial_right;// 0x3EE
	ScriptString tag_spinner_r_front;// 0x3F0
	ScriptString tag_spinner_l_front;// 0x3F2
	ScriptString tag_spinner_r_1;// 0x3F4
	ScriptString tag_spinner_l_1;// 0x3F6
	ScriptString tag_spinner_r_2;// 0x3F8
	ScriptString tag_spinner_l_2;// 0x3FA
	ScriptString tag_spinner_r_3;// 0x3FC
	ScriptString tag_spinner_l_3;// 0x3FE
	ScriptString disconnected;// 0x400
	ScriptString cinematic;// 0x402
	ScriptString uicinematic;// 0x404
	ScriptString logo;// 0x406
	ScriptString connecting;// 0x408
	ScriptString challenging;// 0x40A
	ScriptString connected;// 0x40C
	ScriptString sendingstats;// 0x40E
	ScriptString loading;// 0x410
	ScriptString primed;// 0x412
	ScriptString active_2;// 0x414
	ScriptString map_restart;// 0x416
	ScriptString orientdone;// 0x418
	ScriptString menu_changed;// 0x41A
	ScriptString unlink;// 0x41C
	ScriptString init;// 0x41E
	ScriptString move;// 0x420
	ScriptString traverse;// 0x422
	ScriptString idle;// 0x424
	ScriptString move_run;// 0x426
	ScriptString move_sprint;// 0x428
	ScriptString move_stumpy;// 0x42A
	ScriptString move_start;// 0x42C
	ScriptString move_stop;// 0x42E
	ScriptString move_walk;// 0x430
	ScriptString move_turn_left;// 0x432
	ScriptString move_turn_right;// 0x434
	ScriptString move_run_turn_left;// 0x436
	ScriptString move_run_turn_right;// 0x438
	ScriptString move_turn_around_left;// 0x43A
	ScriptString move_turn_around_right;// 0x43C
	ScriptString move_run_turn_around_left;// 0x43E
	ScriptString move_run_turn_around_right;// 0x440
	ScriptString move_attack;// 0x442
	ScriptString nopatrol;// 0x444
	ScriptString stop_idle;// 0x446
	ScriptString stop_attackidle;// 0x448
	ScriptString stop_attackidle_bark;// 0x44A
	ScriptString stop_attackidle_growl;// 0x44C
	ScriptString pain_main;// 0x44E
	ScriptString pain_front;// 0x450
	ScriptString pain_back;// 0x452
	ScriptString pain_left;// 0x454
	ScriptString pain_right;// 0x456
	ScriptString pain_run_front;// 0x458
	ScriptString pain_run_back;// 0x45A
	ScriptString pain_run_left;// 0x45C
	ScriptString pain_run_right;// 0x45E
	ScriptString death_front;// 0x460
	ScriptString death_back;// 0x462
	ScriptString death_left;// 0x464
	ScriptString death_right;// 0x466
	ScriptString flashed;// 0x468
	ScriptString combat_attackidle;// 0x46A
	ScriptString combat_attackidle_bark;// 0x46C
	ScriptString combat_attackidle_growl;// 0x46E
	ScriptString combat_attack_run;// 0x470
	ScriptString combat_attack_player;// 0x472
	ScriptString combat_attack_player_early;// 0x474
	ScriptString combat_attack_player_lunge;// 0x476
	ScriptString combat_attack_player_close_range;// 0x478
	ScriptString combat_attack_miss;// 0x47A
	ScriptString combat_attack_miss_left;// 0x47C
	ScriptString combat_attack_miss_right;// 0x47E
	ScriptString combat_player_neck_snap;// 0x480
	ScriptString combat_player_neck_miss;// 0x482
	ScriptString traverse_jump_up_40;// 0x484
	ScriptString traverse_jump_up_80;// 0x486
	ScriptString traverse_jump_down_40;// 0x488
	ScriptString traverse_jump_down_80;// 0x48A
	ScriptString traverse_wallhop;// 0x48C
	ScriptString traverse_window;// 0x48E
	ScriptString traverse_through_hole_42;// 0x490
	ScriptString zombie_climb_chain;// 0x492
	ScriptString zombie_jump_down_40;// 0x494
	ScriptString zombie_jump_down_48;// 0x496
	ScriptString zombie_jump_down_72;// 0x498
	ScriptString zombie_jump_down_96;// 0x49A
	ScriptString zombie_jump_down_120;// 0x49C
	ScriptString zombie_jump_down_127;// 0x49E
	ScriptString zombie_jump_down_184;// 0x4A0
	ScriptString zombie_jump_down_190;// 0x4A2
	ScriptString zombie_jump_down_222;// 0x4A4
	ScriptString zombie_jump_down_240;// 0x4A6
	ScriptString zombie_jump_down_286;// 0x4A8
	ScriptString zombie_jump_down_386;// 0x4AA
	ScriptString zombie_jump_up_222;// 0x4AC
	ScriptString zombie_jump_up_to_climb;// 0x4AE
	ScriptString zombie_jump_up_to_climb_coast;// 0x4B0
	ScriptString zombie_ladder_up;// 0x4B2
	ScriptString zombie_lighthouse_crawl_down;// 0x4B4
	ScriptString zombie_mantle_over_40;// 0x4B6
	ScriptString zombie_quad_vent_jump_down;// 0x4B8
	ScriptString zombie_wall_crawl_drop;// 0x4BA
	ScriptString zombie_wall_crawl_drop_quick;// 0x4BC
	ScriptString zombie_ground_rise;// 0x4BE
	ScriptString zombie_ground_rise_death;// 0x4C0
	ScriptString zombie_death;// 0x4C2
	ScriptString zombie_run_melee;// 0x4C4
	ScriptString zombie_walk_melee;// 0x4C6
	ScriptString zombie_crawl_melee;// 0x4C8
	ScriptString zombie_stumpy_melee;// 0x4CA
	ScriptString zombie_window_melee;// 0x4CC
	ScriptString zombie_board_tear;// 0x4CE
	ScriptString zombie_jump_on_bus;// 0x4D0
	ScriptString zombie_board_tear_bus;// 0x4D2
	ScriptString zombie_climbin_bus;// 0x4D4
	ScriptString zombie_bus_window_idle;// 0x4D6
	ScriptString zombie_bus_window_melee;// 0x4D8
	ScriptString swimming_begin;// 0x4DA
	ScriptString swimming_end;// 0x4DC
	ScriptString snd_engine;// 0x4DE
	ScriptString snd_bow_port;// 0x4E0
	ScriptString snd_bow_stbd;// 0x4E2
	ScriptString gv_event;// 0x4E4
	ScriptString gv_action;// 0x4E6
	ScriptString gv_target;// 0x4E8
	ScriptString gv_param;// 0x4EA
	ScriptString gv_condlhs;// 0x4EC
	ScriptString gv_condop;// 0x4EE
	ScriptString gv_condrhs;// 0x4F0
	ScriptString basic_score;// 0x4F2
	ScriptString perk_score;// 0x4F4
	ScriptString challenge_score;// 0x4F6
	ScriptString intel_score;// 0x4F8
	ScriptString difficulty_score;// 0x4FA
	ScriptString total_score;// 0x4FC
	ScriptString freeze;// 0x4FE
	ScriptString up;// 0x500
	ScriptString liveupdate;// 0x502
	ScriptString respawn;// 0x504
	ScriptString dtp_land;// 0x506
	ScriptString hidden;// 0x508
	ScriptString fake_fire;// 0x50A
	ScriptString sprint;// 0x50C
	ScriptString crouch_run;// 0x50E
	ScriptString crouch_walk;// 0x510
	ScriptString entityshutdown;// 0x512
	ScriptString none_2;// 0x514
	ScriptString sidewinder;// 0x516
	ScriptString hellfire;// 0x518
	ScriptString javelin;// 0x51A
	ScriptString ballistic;// 0x51C
	ScriptString wireguided;// 0x51E
	ScriptString tvguided;// 0x520
	ScriptString drone;// 0x522
	ScriptString heatseeking;// 0x524
	ScriptString firecaster;// 0x526
	ScriptString fire_flicker;// 0x528
	ScriptString electrical_flicker;// 0x52A
	ScriptString flicker_then_stop;// 0x52C
	ScriptString generic_double_strobe;// 0x52E
	ScriptString generic_strobe;// 0x530
	ScriptString light_off;// 0x532
	ScriptString light_solid;// 0x534
	ScriptString television;// 0x536
	ScriptString generic_flickering;// 0x538
	ScriptString generic_pulsing;// 0x53A
	ScriptString explode_then_flicker;// 0x53C
	ScriptString robot;// 0x53E
	ScriptString footstep_left_large;// 0x540
	ScriptString footstep_left_small;// 0x542
	ScriptString footstep_right_large;// 0x544
	ScriptString footstep_right_small;// 0x546
	ScriptString footstep_left;// 0x548
	ScriptString footstep_right;// 0x54A
	ScriptString footstep_front_left;// 0x54C
	ScriptString footstep_front_right;// 0x54E
	ScriptString footstep_rear_left;// 0x550
	ScriptString footstep_rear_right;// 0x552
	ScriptString footstep_front_left_small;// 0x554
	ScriptString footstep_front_right_small;// 0x556
	ScriptString footstep_rear_left_small;// 0x558
	ScriptString footstep_rear_right_small;// 0x55A
	ScriptString footstep_front_left_shuffle;// 0x55C
	ScriptString footstep_front_right_shuffle;// 0x55E
	ScriptString footstep_rear_left_shuffle;// 0x560
	ScriptString footstep_rear_right_shuffle;// 0x562
	ScriptString footstep_front_left_scrape;// 0x564
	ScriptString footstep_front_right_scrape;// 0x566
	ScriptString footstep_rear_left_scrape;// 0x568
	ScriptString footstep_rear_right_scrape;// 0x56A
	ScriptString dogstep_lf;// 0x56C
	ScriptString dogstep_rf;// 0x56E
	ScriptString dogstep_lr;// 0x570
	ScriptString dogstep_rr;// 0x572
	ScriptString jnt_f_l_ankle;// 0x574
	ScriptString jnt_f_r_ankle;// 0x576
	ScriptString jnt_r_l_ankle;// 0x578
	ScriptString jnt_r_r_ankle;// 0x57A
	ScriptString jnt_f_l_knee_upper_dmg;// 0x57C
	ScriptString jnt_f_r_knee_upper_dmg;// 0x57E
	ScriptString jnt_r_l_knee_upper_dmg;// 0x580
	ScriptString jnt_r_r_knee_upper_dmg;// 0x582
	ScriptString open;// 0x584
	ScriptString closed;// 0x586
	ScriptString opening;// 0x588
	ScriptString closing;// 0x58A
	ScriptString targetted_by_zombie;// 0x58C
	ScriptString actor;// 0x58E
	ScriptString actor_spawner;// 0x590
	ScriptString actor_corpse;// 0x592
	ScriptString _int;// 0x594
	ScriptString _float;// 0x596
	ScriptString ambient_package;// 0x598
	ScriptString save_restore;// 0x59A
	ScriptString difficulty_change;// 0x59C
	ScriptString tag_board_1;// 0x59E
	ScriptString tag_board_2;// 0x5A0
	ScriptString tag_board_3;// 0x5A2
	ScriptString tag_board_4;// 0x5A4
	ScriptString tag_board_5;// 0x5A6
	ScriptString tag_board_6;// 0x5A8
	ScriptString tag_control_dial_1;// 0x5AA
	ScriptString tag_control_dial_2;// 0x5AC
	ScriptString tag_control_dial_3;// 0x5AE
};

extern scr_const_t* scr_const;

// cscr_vm.cpp

GAME_EXPORT void Scr_NotifyNum(int entnum, unsigned int classnum, unsigned int stringValue, unsigned int paramCount);

GAME_EXPORT void Scr_AddString(scriptInstance_t inst, const char* value);
GAME_EXPORT void Scr_AddInt(scriptInstance_t inst, int value);
GAME_EXPORT void Scr_AddConstString(scriptInstance_t inst, unsigned int value);
GAME_EXPORT void Scr_AddUndefined(scriptInstance_t inst);

GAME_EXPORT unsigned short Scr_ExecThread(scriptInstance_t inst, int handle, unsigned int paramCount);
GAME_EXPORT void Scr_FreeThread(scriptInstance_t inst, unsigned short handle);

// cscr_main.cpp

GAME_EXPORT unsigned short Scr_LoadScript(scriptInstance_t inst, const char* filename);
GAME_EXPORT int Scr_GetFunctionHandle(scriptInstance_t inst, const char* filename, const char* name, XAssetHeader* assetHeader, bool errorIfMissing);

// cscr_stringlist.cpp

GAME_EXPORT void Scr_SetString(unsigned short* to, unsigned int from);
GAME_EXPORT const char* SL_ConvertToString(unsigned int stringValue);
GAME_EXPORT unsigned int SL_GetString(const char* str, unsigned int user);

#endif /* __CLIENTSCRIPT_H__ */
